roam/zettelkasten_principles.org
:PROPERTIES:
:ID:       6a03539f-008a-4f3d-8480-784fb7192702
:END:
#+title: Zettelkasten principles
#+date: [2021-12-22 Wed 23:42]
- Source: https://adrian-philipp.com/notes/zettelkasten-principles
- Author: [[id:94369120-020b-43c3-b952-c63f9c96552d][Adrian Philipp]]
- Related: [[id:42ee0edd-831e-46b6-82b1-199427452149][Zettelkasten]], [[id:1479941e-151a-4bd1-8b31-ee11804d220c][Note Taking]]

* Principles
[[id:57e0d79f-5f0d-48eb-9b76-83ec2cd3fd58][Niklas Luhmann]] created these to create a web of ideas
- *Atomicity*
- *Autonomy*
- *Link*, link like your life depends no it
- *Why*, explain yourself
- *No copy pasting*, explain yourself to yourself
- *Sources*, for future reference
- *No folder*, tags are better. You need to link more.
- *Connection Notes*, you guessed it, for linking. Containing information about the link
- *Outline Notes*, overview on a topic
- *Don't delete, add notes*, revisions link to older notes
