content/posts/zettelkasten_principles.md
+++
title = "Zettelkasten principles"
author = ["Daniel Biasiotto"]
date = 2021-12-22T23:42:00+01:00
draft = false
+++

-   Source: <https://adrian-philipp.com/notes/zettelkasten-principles>
-   Author: [Adrian Philipp]({{< relref "adrian_philipp.md" >}})
-   Related: [Zettelkasten]({{< relref "20200528213816-zettelkasten.md" >}}), [Note Taking]({{< relref "20200528214634-note_taking.md" >}})


## Principles {#principles}

[Niklas Luhmann]({{< relref "20210606204109-niklas_lumann.md" >}}) created these to create a web of ideas

-   **Atomicity**
-   **Autonomy**
-   **Link**, link like your life depends no it
-   **Why**, explain yourself
-   **No copy pasting**, explain yourself to yourself
-   **Sources**, for future reference
-   **No folder**, tags are better. You need to link more.
-   **Connection Notes**, you guessed it, for linking. Containing information about the link
-   **Outline Notes**, overview on a topic
-   **Don't delete, add notes**, revisions link to older notes
